Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] WEBTOON LATAM_Dreaming Freedom.tmx
Source language: en
Languages: es_419

source: I didn’t have the courage to get angry in front of a crowd.
es_419: NO ME ANIMÉ A ENOJARME FRENTE A TANTA GENTE.

source: I feel bad for her...
es_419: ME DA LÁSTIMA…

source: you used to stab your classmates with scissors until they bled, but now you’re in love?
es_419: SOLÍAS APUÑALAR A TUS COMPAÑERAS CON TIJERAS HASTA QUE SE DESANGRABAN… ¿AHORA ESTÁS ENAMORADA?

source: we must go to and from school at the same time.
es_419: PARECE VAMOS Y VOLVEMOS DE LA ESCUELA A LA MISMA HORA.

source: her boyfriend is--
es_419: SU NOVIO ES…

source: come on.
es_419: VAMOS.

source: I think he’s the white-haired man that juhyeon was talking about.
es_419: CREO QUE ES EL SUJETO DE CABELLO BLANCO QUE MENCIONÓ JUHYEON…

source: I just have to put in a little more work.
es_419: SOLO TENGO QUE ESFORZARME UN POCO MÁS.

source: why are you curious about that?
es_419: ¿POR QUÉ QUERÍAS SABERLO?

source: if you two live in the same direction as me, let’s walk home together.
es_419: SI VIVEN EN LA MISMA DIRECCIÓN QUE YO, PODEMOS VOLVER JUNTAS.

source: you dumb bitches i just didn’t have time to dry my hair after i washed it
es_419: NO TUVE TIEMPO DE SECARME EL CABELLO DESPUÉS DE LAVÁRMELO, IMBÉCILES

source: w-what are you doing?! give it back!
es_419: ¡¿QUÉ HACES?! ¡DEVUÉLVEMELO!

source: hey, sora!
es_419: ¡SORA!

source: once I start going to one, I won’t be able to hang out as often.
es_419: CUANDO EMPIECE A IR A UNO, YA NO TENDRÉ MUCHO TIEMPO PARA SALIR.

source: I may be friends with juhyeon,
es_419: QUIZÁS SEA AMIGO DE JEONGMIN,

source: when we were in grade school...
es_419: CUANDO ESTÁBAMOS EN PRIMARIA,

source: jeez... she’s scary...
es_419: VAYA… DA UN POCO DE MIEDO…

source: ah... okay!
es_419: AH… ¡BIEN!

source: don’t feel guilty or anything. we’ll help you.
es_419: NO TE SIENTAS CULPABLE. TE AYUDAREMOS.

source: ...it makes me sick to my stomach.
es_419: … SE ME REVUELVE EL ESTÓMAGO.

source: bolt
es_419: SOBRESALTO

source: I thought she didn’t like stuff like this...
es_419: CREÍ QUE NO LE AGRADABAN ESTAS COSAS…

source: I’ve been abandoned by juhyeon.
es_419: JUHYEON ME ABANDONÓ.

source: why isn’t there anyone in the room?
es_419: ¿POR QUÉ NO HAY NADIE AQUÍ?

source: why are you spacing out?
es_419: ¿DÓNDE TIENES LA CABEZA?

source: huh? huh?!
es_419: ¿EH? ¡¿QUÉ?!

source: ...what is this?
es_419: ¿QUÉ ES ESTO…?

source: what was I thinking?!
es_419: ¡¿EN QUÉ ESTABA PENSANDO?!

source: we’re friends...
es_419: SOMOS AMIGAS…

source: the sky is so blue today.
es_419: QUÉ HERMOSO ESTÁ EL CIELO HOY.

source: if another coincidence happens, all the better.
es_419: SI HAY OTRA COINCIDENCIA, PERFECTO…

source: did jeongmin not wash up today?
es_419: ¿JEONGMIN NO SE DUCHÓ HOY?

source: why won’t they die?
es_419: POR QUÉ NO SE MUEREN

source: who? oh...
es_419: ¿A QUIÉN? AH…

source: did you say that because it’s possible?
es_419: ¿ESO SIGNIFICA QUE ES POSIBLE?

source: what’s going on between you two?
es_419: ¿QUÉ PASA CON USTEDES?

source: everyone around her is being lied to.
es_419: LES MIENTE A TODOS LOS QUE TIENE A SU ALREDEDOR.

source: I was mistaken.
es_419: ESTABA EQUIVOCADA.

source: it’s interesting.
es_419: QUÉ INTERESANTE…

source: hey, you listen to this kind of music?
es_419: ¿TE GUSTA ESTA MÚSICA?

source: just take good things for what they are!
es_419: ¡ACEPTA LAS COSAS BUENAS Y NO PIENSES TANTO!

source: he’s never been on his phone so much around me before...
es_419: NUNCA ESTUVO TAN PEGADO A SU TELÉFONO CUANDO ESTÁ CONMIGO.

source: promise?
es_419: ¿LO PROMETES?

source: huh...? again...?
es_419: ¿EH…? ¿DE NUEVO…?

source: ah!!!!!! i want to die!!!!!!
es_419: AH!!!!!! ME QUIERO MORIR!!!!!!

source: find out who jaehyeok is talking to.
es_419: AVERIGUA CON QUIÉN HABLA JAEHYEOK.

source: omg, hahaha
es_419: UFF, JA, JA, JA.

source: we picked on you and ostracized you first,
es_419: PRIMERO TE TOMAMOS DE PUNTO Y TE AISLAMOS.

source: did you dislike it?
es_419: ¿NO TE GUSTÓ?

source: honestly, no...
es_419: NO…

source: do you want to go out with me?
es_419: ¿QUISIERAS SALIR CONMIGO?

source: after graduating, I spent a few average years in middle school.
es_419: NOS GRADUAMOS, Y PASÉ ALGUNOS AÑOS ABURRIDOS EN LA SECUNDARIA.

source: how annoying...
es_419: QUÉ MOLESTIA…

source: aaargh!! eunju, that bitch!!
es_419: ¡AAAH! ¡ESA PERRA DE EUNJU!

source: all right.
es_419: ESTÁ BIEN.

source: okay, just focus on your own life from now on--
es_419: BIEN, A PARTIR DE AHORA, PIENSA EN TU PROPIA VIDA…

source: snicker
es_419: RISITA

source: the more you do, the closer we get...
es_419: CUANTO MÁS LO HAGAS, MÁS UNIDAS ESTAMOS…

source: if I don’t have them, things will be the same as they were at the beginning of the school year.
es_419: SIN ELLAS, TODO SERÁ EXACTAMENTE COMO FUE AL COMIENZO DEL AÑO ESCOLAR.

source: that must be awkward...
es_419: DEBE SER RARÍSIMO…

source: he really is just on his phone.
es_419: ES VERDAD QUE VIVE PEGADO AL TELÉFONO.

source: ah, and it’s probably best that you don’t try to take my phone by force.
es_419: AH, Y SERÁ MEJOR QUE NO INTENTES QUITARME EL TELÉFONO A LA FUERZA.

source: Ugh just fucking die!!!!!!!
es_419: ¡¡¡MUÉRANSE DE UNA PUTA VEZ!!!

source: what about the likes of me?
es_419: ¿QUÉ PASA CON LA GENTE COMO YO?

source: clack
es_419: CLAC

source: when I got to high school and saw your face,
es_419: CUANDO EMPEZÓ LA PREPARATORIA Y TE VI…

source: what?! is juhyeon sick?!
es_419: ¡¿QUÉ?! ¡¿JUHYEON ESTÁ MAL?!

source: it doesn’t seem like she has anyone else to keep in touch with.
es_419: PARECE QUE NO TIENE A NADIE CON QUIÉN HABLAR.

source: what did I do to you...?
es_419: ¿QUÉ TE HICE…?

source: oh, I found you!
es_419: ¡TE ENCONTRÉ!

source: I can’t stand listening to sora whine about being hungry any longer.
es_419: YA ESTOY HARTA DE ESCUCHAR A SORA QUEJARSE PORQUE TIENE HAMBRE…

source: a man...?
es_419: ¿UN HOMBRE…?

source: did jeongmin mention that they knew each other?
es_419: ¿JEONGMIN DIJO QUE SE CONOCÍAN?

source: I wonder when she’ll come back...
es_419: ME PREGUNTO CUÁNDO VOLVERÁ…

source: no one is on my side, not my family or friends.
es_419: NADIE ESTÁ DE MI LADO; NI MI FAMILIA NI MIS AMIGAS.

source: oh no... she’ll definitely try to pick a fight with me this time...
es_419: AY, NO… AHORA BUSCARÁ PELEA, ESTOY SEGURA.

source: what is this, anyways? it looks like an off-brand cartoon character.
es_419: ¿QUÉ ES? PARECE UN PERSONAJE DE CARICATURAS DE UNA MARCA GENÉRICA.

source: I don’t recall...
es_419: NO LO RECUERDO…

source: she’s staying quiet, so I’m just going to watch what she does.
es_419: POR AHORA, ESTÁ TRANQUILA; ESPERARÉ A VER QUÉ HACE…

source: jerks like that...
es_419: IDIOTAS COMO ESAS…

source: I said come here, you bitch.
es_419: DIJE QUE VINIERAS, PERRA.

source: you too, eunju?
es_419: ¿Y TÚ, EUNJU?

source: come with us next time, jeongmin!
es_419: ¡TIENES QUE VENIR CON NOSOTRAS LA PRÓXIMA VEZ, JEONGMIN!

source: there have been a lot of hard times up until now.
es_419: HASTA AHORA, LLEVABA MUCHO TIEMPO PASÁNDOLA MAL.

source: we’re...
es_419: SOMOS…

source: fine, since we’re breaking it off, let me give you a piece of my mind.
es_419: BIEN, YA QUE NO VAMOS A HABLAR MÁS, TE DIRÉ LO QUE PIENSO EN VERDAD.

source: are you still being like this? resolve the issue now.
es_419: ¿SIGUES COMO AYER? RESUELVE LAS COSAS DE UNA VEZ POR TODAS.

source: I thought that I’d finally escaped from those crappy people...
es_419: CREÍ QUE HABÍA LOGRADO HUIR DE ESA GENTE…

source: I don’t see any possibility of them becoming friends again.
es_419: NO CREO QUE ARREGLEN LAS COSAS OTRA VEZ.

source: lower
es_419: BAJA

source: pleaseeee hahahahahaha hahahahahaha
es_419: POR FAVOR JAJAJAJAJAJAJAJAJA

source: I was so grateful for my current situation...
es_419: ESTABA TAN AGRADECIDA POR MI SITUACIÓN ACTUAL…

source: who are you talking to?
es_419: ¿CON QUIÉN HABLAS?

source: sigh
es_419: UFF

source: I didn’t try to lucid dream!
es_419: ¡NO QUISE TENER UN SUEÑO LÚCIDO!

source: how did we even get here from talking about jeongmin...
es_419: ¿CÓMO LLEGAMOS A ESTO? ESTÁBAMOS HABLANDO DE JEONGMIN…

source: pat
es_419: TAS

source: ugh, she's so damn annoying.
es_419: ARGH, ES TAN INSOPORTABLE.

source: h-how did it go?
es_419: ¿CÓ-CÓMO TE FUE?

source: you would only eat my kimchi stew when you were younger.
es_419: CUANDO ERAS CHICA, SOLO QUERÍAS COMER ESO.

source: I never said that...
es_419: NUNCA DIJE ESO…

source: saying that you were trying to act cool by making up a story about some boy you were talking to.
es_419: DECÍAN QUE TE HACÍAS LA IMPORTANTE E INVENTASTE UNA HISTORIA SOBRE UN CHICO CON QUIEN HABLABAS.

source: how long has it been since I’ve had such a long conversation with another person?
es_419: ¿CUÁNTO HACE QUE NO TENGO UNA CHARLA TAN LARGA CON ALGUIEN?

source: Miju Yang left the chat
es_419: MIJU YANG ABANDONÓ EL CHAT

source: after that...
es_419: DESPUÉS DE ESO…

source: push
es_419: MUESTRA

source: ...but I welcome it today.
es_419: … PERO HOY ES JUSTO LO QUE BUSCABA.

source: after I talked to you, he called me again.
es_419: CUANDO TÚ Y YO TERMINAMOS DE HABLAR, MI AMIGO ME LLAMÓ OTRA VEZ.

source: h-huh?!
es_419: ¡¿EH?!

source: there’s no way he is.
es_419: ES IMPOSIBLE QUE SEA TU NOVIO.

source: come here for a second.
es_419: VEN UN MOMENTO.

source: what, you can’t talk without sora?
es_419: ¿NO PUEDES HABLAR SI NO ESTÁ SORA?

source: of course!
es_419: ¡CLARO!

source: and look, the latest post is from just now.
es_419: MIRA. LA ÚLTIMA PUBLICACIÓN ES DE HACE UN MOMENTO.

source: do you have a crush on her?
es_419: ¿TE GUSTA?

source: I was wondering why you called me first,
es_419: ME PREGUNTABA POR QUÉ ME LLAMASTE,

source: if I wasn’t so weak...
es_419: SI NO FUERA TAN DÉBIL…

source: look at you, sleeping tight...
es_419: MIRA CÓMO DUERMES…

source: what’s gotten into her?
es_419: ¿QUÉ LE PASA?

source: huh?!
es_419: ¡¿EH?!

source: are you mute?
es_419: ¿TE QUEDASTE SIN VOZ?

source: my bangs look kind of greasy...
es_419: TENGO FLEQUILLO UN POCO GRASIENTO…

source: oh, yeah.
es_419: AH, SÍ.

source: didn’t sora say she didn’t have any money...?
es_419: ¿SORA NO DIJO QUE NO TENÍA DINERO…?

source: just as I imagined... my dad can’t move a muscle against me...
es_419: ES COMO LO IMAGINÉ… MI PAPÁ NO PUEDE HACER NADA CONTRA MÍ…

source: have you heard anything from juhyeon?
es_419: ¿SABES ALGO DE JUHYEON?

source: I woke up later than expected.
es_419: ME DESPERTÉ MUY TARDE.

source: I started watching it at first because it was cute!
es_419: ¡YO TAMBIÉN EMPECÉ A VERLA PORQUE ME PARECIÓ TIERNA!

source: what do you want?
es_419: ¿QUÉ QUIERES?

source: ah, I shouldn’t have said that...
es_419: PERDÓN, NO DEBÍ DECIRLO…

source: based on their personalities, I don’t think they took you in just to make you do stuff for them.
es_419: TENIENDO EN CUENTA SUS PERSONALIDADES, NO CREO QUE SE HAYAN ACERCADO A TI PARA QUE LES HICIERAS FAVORES.

source: as if... he kept chasing me around, so I just...
es_419: Sí, CLARO… NO DEJABA DE SEGUIRME, ASÍ QUE…

source: Yeah, it was!
es_419: ¡SÍ, ME GUSTÓ!

source: mom...
es_419: MAMÁ…

source: what are the chances that they’ll start hanging out again...?
es_419: ¿CUÁLES SON LAS PROBABILIDADES DE QUE SE VUELVAN A AMIGAR?

source: I’m sure that’s all it is.
es_419: SEGURO QUE SOLO ES ESO.

source: bye!
es_419: ¡ADIÓS!

source: damn it... she just had to show her of all people...
es_419: MIERDA… Y SE LAS TENÍA QUE MOSTRAR JUSTO A ELLA…

source: ...but those two.
es_419: … NO YO.

source: I have to go to school.
es_419: TENGO QUE IR A LA ESCUELA.

source: is that all?
es_419: ¿ESO ES TODO?

source: is it possible that I know who you are?
es_419: ¿HAY UNA PROBABILIDAD DE QUE NOS CONOZCAMOS?

source: what is it?
es_419: ¿QUÉ SUCEDE?

source: and she acts like such a victim, but it doesn’t make any sense.
es_419: Y SE HACE LA VÍCTIMA, PERO NADA TIENE SENTIDO.

source: I won’t expect much anymore.
es_419: YA NO TENDRÉ MUCHAS EXPECTATIVAS.

source: I’m so annoyed, though.
es_419: PERO ESTOY MUY MOLESTA…

source: hah.
es_419: JA

source: and it’s not like I’m as cool or attractive as you...
es_419: NO SOY ALGUIEN GENIAL NI ATRACTIVA COMO TÚ…

source: I’m tired of this space too...
es_419: Y ESTOY HARTO DE ESTE LUGAR…

source: she was all alone before you started hanging out with her.
es_419: ESTABA SOLA HASTA QUE EMPEZASTE A JUNTARTE CON ELLA.

source: stop using mine all the time, hoe.
es_419: DEJA DE USAR EL MÍO TODO EL TIEMPO, ZORRA.

source: ...except for "this man".
es_419: … EXCEPTO A "ESTE SUJETO".

source: I met juhyeon at our cram school.
es_419: CONOCÍ A JUHYEON EN LA ACADEMIA.

source: aren’t they kind of... you know?
es_419: ¿NO SON UN POCO…? YA SABES.

source: I’m tired of acting like a fool even when I know the truth.
es_419: ESTOY HARTA DE QUEDAR COMO IDIOTA CUANDO SÉ LA VERDAD.

source: she’s in the emergency room due to an unexpected accident.
es_419: JUHYEON ESTÁ INTERNADA DEBIDO A UN ACCIDENTE INESPERADO.

source: how long do you think that will last?
es_419: ¿CUÁNTO CREES QUE DURARÁ ESO…?

source: oh... but I think jeongmin is really hungry...
es_419: AH… PERO CREO QUE JEONGMIN TIENE MUCHA HAMBRE…

source: hey, girls.
es_419: OIGAN, CHICAS.

source: at least if I don’t react, they get bored and leave faster...
es_419: AL MENOS, SI NO RESPONDO, SE ABURRIRÁN Y SE IRÁN MÁS RÁPIDO…

source: Should i just kill these bitches
es_419: DEBERÍA MATAR A ESTAS PERRAS

source: my hand can heal you!
es_419: ¡PUEDO CURARTE CON LA MANO!

source: everyone blocked me.
es_419: TODAS ME BLOQUEARON.

source: I haven’t been getting proper sleep, so I’m just exhausted.
es_419: ESTOY EXHAUSTA PORQUE NO HE DORMIDO BIEN.

source: didn’t you hear what juhyeon said? it’s karma.
es_419: ¿NO OÍSTE LO QUE DIJO JUHYEON? ES KARMA.

source: oh, we’re not going home.
es_419: NO VAMOS A CASA…

source: why am I supposed to keep our relationship a secret from jeongmin?
es_419: ¿POR QUÉ NO QUIERES QUE LE CUENTE DE NOSOTROS A JEONGMIN?

source: just pretend you’re playing with a sad kid and stay a little longer.
es_419: HAZ DE CUENTA QUE ESTÁS JUGANDO CON ALGUIEN TRISTE Y QUÉDATE UN POCO MÁS.

source: I-I really wanted to get closer to you.
es_419: Q-QUERÍA CONOCERTE MEJOR.

source: the jeongmin I know could never do that...
es_419: LA JEONGMIN QUE CONOCÍ NO PODRÍA HACER ALGO ASÍ…

source: nothing, nothing.
es_419: NADA, NADA.

source: sorry, jaehyeok...
es_419: LO SIENTO, JAEHYEOK,

source: ...and I think I want to get revenge on jeongmin.
es_419: … Y CREO QUE QUIERO VENGARME DE JEONGMIN.

source: I have something to show you!
es_419: ¡TENGO ALGO QUE MOSTRARTE!

source: oh... that’s big news.
es_419: AH… QUÉ NOTICIAS JUGOSAS.

source: I want to get snacks too.
es_419: YO TAMBIÉN QUIERO COMPRAR ALGO.

source: um... well...
es_419: EH, BUENO…

source: fidget
es_419: JUGUETEA

source: hahahaha
es_419: JAJAJAJA

source: everyone find a partner and get in line.
es_419: BUSQUEN UNA COMPAÑERA Y HAGAN FILA.

source: oh, right, I don’t have time for this right now.
es_419: ES VERDAD; TENGO QUE APURARME.

source: haha, no way.
es_419: JAJA. ¡QUÉ DICES!

source: just be my backup.
es_419: QUIERO QUE ME AYUDES.

source: oh, and do you want to try tying your hair?
es_419: AH, ¿QUIERES ATARTE EL CABELLO TAMBIÉN?

source: just as juhyeon said, once she took me under her wing again...
es_419: TAL Y COMO ELLA DIJO. CUANDO JUHYEON ME ACEPTÓ DE NUEVO,

source: why is someone like jeongmin...
es_419: ¿POR QUÉ ALGUIEN COMO JEONGMIN…

source: what do I have to give them...?
es_419: ¿QUÉ PUEDO DARLES YO…?

source: what happened to you over the last few days? where’s this romance coming from?
es_419: ¿QUÉ TE PASÓ ÚLTIMAMENTE? ¿POR QUÉ ESTÁS TAN ROMÁNTICA?

source: what? oh...
es_419: ¿QUÉ? AH…

source: I can do it!
es_419: ¡PUEDO HACERLO SIN PROBLEMA!

source: *appears to be a knock-off of "anyway!anpanman"
es_419: *PARECE SER UNA COPIA DE "¡NO IMPORTA! ANPANMAN"

source: ...but school isn’t as terrible it used to be.
es_419: … PERO LA ESCUELA NO ES TAN HORRIBLE COMO ANTES.

source: we were good friends in the beginning, but the girls she hung out with were kind of... you know.
es_419: ÉRAMOS BUENAS AMIGAS, PERO LAS CHICAS CON LAS QUE ELLA SE JUNTABA ERAN… YA SABEN…

source: 글 그림 2L 밑색 도움 kk
es_419: ARTE/HISTORIA DE 2L AYUDA CON EL COLOR KK

source: ...but I can really never tell what juhyeon is thinking, either.
es_419: … PERO TAMBIÉN ME CUESTA MUCHÍSIMO SABER QUÉ PIENSA JUHYEON.

source: you’re going to come, right?
es_419: VIENES, ¿NO?

source: you would have never figured that out in a thousand years!
es_419: ¡PERO TÚ JAMÁS TE HABRÍAS DADO CUENTA!

source: jeongmin, where were you?
es_419: ¿DÓNDE ESTABAS, JEONGMIN?

source: I’m still in my second year of middle school, and this rumor is going to follow me around to high school...
es_419: AÚN ESTOY EN EL SEGUNDO AÑO DE SECUNDARIA, PERO ESTE RUMOR ME ACOMPAÑARÁ HASTA LA PREPARATORIA…

source: so does she not have a dad anymore?
es_419: ¿ENTONCES YA NO TIENE PAPÁ?

source: ya I’m talking to him now and it’s giving me cancer
es_419: SÍ, LE ESTOY HABLANDO Y ME DA CÁNCER

source: I told myself that I wouldn’t let myself be treated like this anymore, but this isn’t the right time.
es_419: ME PROMETÍ A MÍ MISMA NO DEJAR QUE ME TRATARAN ASÍ NUNCA MÁS, PERO ESTE NO ES EL MEJOR MOMENTO.

source: those girls you were talking about.
es_419: ESAS CHICAS DE LAS QUE HABLASTE…

source: I’m kind of tired today...
es_419: HOY ESTOY AGOTADA…

source: school is basically a student’s entire life.
es_419: LA VIDA ENTERA DE UN ESTUDIANTE TRANSCURRE EN LA ESCUELA.

source: it’s okay...!
es_419: ¡ESTÁ BIEN…!

source: I guess it is nice to have someone with connections.
es_419: SUPONGO QUE ES ÚTIL TENER A ALGUIEN CON CONEXIONES.

source: I don’t even know how I feel, but he talked as if he did.
es_419: NI SIQUIERA YO SÉ CÓMO ME SIENTO, PERO ÉL HABLABA COMO SI LO SUPIERA…

source: you know seungha gwon in our class?
es_419: ¿CONOCES A SEUNGHA GWON DE NUESTRA CLASE?

source: why not?
es_419: ¿POR QUÉ?

source: hey, jeongmin! if you keep doing that, you’re not gonna go to college or get a good job and you’ll end up on the streets.
es_419: ¡OYE, JEONGMIN! SI SIGUES ASÍ, NO PODRÁS IR A LA UNIVERSIDAD NI CONSEGUIR UN BUEN EMPLEO, Y TERMINARÁS VIVIENDO EN LA CALLE.

source: if you were really worried about me...
es_419: SI REALMENTE TE PREOCUPARA…

source: that’s alright!
es_419: ¡NO HACE FALTA!

source: yeah, I can do that.
es_419: SÍ, PUEDO HACER ESO.

source: home settings kkakaotalk
es_419: INICIO CONFIGURACIÓN KKAKAOTALK

source: if our class found out about this...
es_419: SI LA CLASE LO SUPIERA…

source: what is this?
es_419: ¿QUÉ ES ESTO?

source: she claims to have been bullied by jeongmin,
es_419: DICE QUE JEONGMIN LE HIZO BULLYING,

source: you’ve always been this kind of person.
es_419: PERO SIEMPRE FUISTE ASÍ.

source: we’re all just high schoolers...
es_419: TODOS SOMOS ESTUDIANTES DE LA PREPARATORIA…

source: but it doesn’t feel right to tell them... it’s not like I trust them completely...
es_419: PERO NO CREO QUE SEA BUENA IDEA… NO CONFÍO EN ELLAS COMPLETAMENTE…

source: juhyeon really is a total saint.
es_419: JUHYEON ES UNA SANTA.

source: I didn’t think much about how she knew so many people’s histories and secrets...
es_419: NO ME PREOCUPÓ EL HECHO DE QUE CONOCIERA HISTORIAS Y SECRETOS DE TANTA GENTE…

source: then prove it.
es_419: PRUÉBALO.

source: I almost fell for it myself.
es_419: CASI ME LO CREO.

source: ...was strong...
es_419: … FUERA FUERTE…

source: I’ve been calling your name a million times!
es_419: ¡TE LLAMÉ MIL VECES!

source: she might claim i’m bullying her lol
es_419: PODRÍA DECIR QUE LE HAGO BULLYING XD

source: I’m saying this to you because you’re the only one I trust. you have to keep this a secret.
es_419: TE LO CUENTO PORQUE ERES LA ÚNICA EN QUIEN CONFÍO. TIENES QUE GUARDAR EL SECRETO.

source: you know, juhyeon...
es_419: SABES, JUHYEON…

source: please stop messing with my dreams whenever you feel like it.
es_419: ¡DEJA DE METERTE EN MIS SUEÑOS CUANDO SE TE DÉ LA GANA!

source: he’s right...
es_419: TIENE RAZÓN…

source: ...acting different than before. what’s happening...?
es_419: … SE ESTÁ COMPORTANDO DE FORMA MUY DIFERENTE. ¿QUÉ SUCEDE…?

source: someone might assume you were actually nice.
es_419: ALGUIEN PODRÍA PENSAR QUE ERAS BUENA PERSONA.

source: no matter how they try to outsmart me, we’re all just high schoolers.
es_419: NO IMPORTA LO QUE INTENTEN PARA ENGAÑARME, SOMOS TODAS ALUMNAS DE PREPARATORIA.

source: eunju probably agreed because it was juhyeon’s request...
es_419: EUNJU PROBABLEMENTE ACEPTÓ PORQUE SE LO PIDIÓ JUHYEON,

source: what the fuck did I just hear her say?
es_419: ¿QUÉ MIERDA ACABA DE DECIR?

source: wasn’t she shaking just a few days ago?
es_419: ¿NO ESTABA TEMBLANDO HACE UNOS DÍAS?

source: I just want you to die right here!!
es_419: ¡QUIERO QUE MUERAS AHORA MISMO!

source: I’ve always wanted to come.
es_419: SIEMPRE QUISE VENIR.

source: she deserves it.
es_419: SE LO MERECE.

source: oh, now that I think about it, I forgot to get your contact information!
es_419: AH, AHORA QUE LO PIENSO, ¡ME OLVIDÉ DE PEDIRTE TU NÚMERO!

source: t-that’s not my account...
es_419: ESA NO ES MI CUENTA…

source: if that’s true, that’s wild.
es_419: SI ES ASÍ, SERÍA INCREÍBLE.

source: we’re not friends.
es_419: NO SOMOS AMIGAS.

source: smack
es_419: PAF

source: the three of us will be able to stay friends for a long time if I keep being the mediator, right?
es_419: SI SIGO SIENDO LA MEDIADORA, LAS TRES PODREMOS SER AMIGAS BASTANTE TIEMPO, ¿VERDAD?

source: ...that he would always be by my side.
es_419: … SIEMPRE ESTARÍA A MI LADO.

source: eunju is so dramatic, she might lose it if i cut her off and start hanging out with you guys
es_419: EUNJU ES MUY DRAMÁTICA. PODRÍA VOLVERSE LOCA SI LA HAGO A UN LADO PARA SALIR CON USTEDES.

source: first, tell me what juhyeon is scheming.
es_419: PRIMERO, DIME QUÉ TRAMA JUHYEON.

source: ew, she’s so gross.
es_419: PUAJ, QUÉ ASCO.

source: I want to go out after school already.
es_419: NO VEO LA HORA DE SALIR DESPUÉS DE CLASES.

source: um... you should be careful too...
es_419: EH… TÚ TAMBIÉN DEBERÍAS TENER CUIDADO.

source: it really pisses me off that you’re so ungrateful and think I’m some kind of pathetic loser.
es_419: ME DA MUCHA RABIA QUE SIEMPRE SEAS TAN DESAGRADECIDA Y QUE PIENSES QUE YO SOY UNA PERDEDORA.

source: he basically held me prisoner at the pc room because he thought I wouldn’t show up again.
es_419: BÁSICAMENTE ME ENCERRÓ CON MI PC PORQUE CREYÓ QUE NO VOLVERÍA A AYUDARLO.

source: why is she calling for me? so annoying...
es_419: ¿POR QUÉ ME LLAMA? QUÉ PESADA…

source: it’s dad...
es_419: ES PAPÁ…

source: I’ve opened up to him about almost everything.
es_419: YO LE CONTÉ CASI TODO.

source: ...I am nothing without juhyeon ha...
es_419: NO SOY NADA SIN JUHYEON HA…

source: okay!
es_419: ¡BIEN!

source: why would they just choose to take you in when you have a bad reputation?
es_419: ¿POR QUÉ SE ACERCARÍAN A TI, QUE TIENES MALA REPUTACIÓN?

source: stop it.
es_419: YA BASTA.

source: poor jeongmin...
es_419: POBRE JEONGMIN…

source: whatever. it’s like talking to a wall when we argue about problems like this.
es_419: BAH, COMO SEA. CUANDO DISCUTIMOS POR COSAS ASÍ, ES COMO HABLARLE A UNA PARED.

source: hey, you made the right decision!
es_419: ¡TOMASTE LA MEJOR DECISIÓN!

source: click
es_419: CLIC

source: peek
es_419: MIRA

source: clock maps weather
es_419: RELOJ MAPAS CLIMA

source: I would have been too embarrassed to do that.
es_419: A MÍ ME HABRÍA DADO VERGÜENZA.

source: you know your personality is crap, don’t you?
es_419: TIENES UN CARÁCTER HORRIBLE, ¿LO SABES?
